-- 快捷键设置

-- 快捷键前缀键(类似于Ctrl)
vim.g.mapleader = " "
vim.g.maplocalleader = " "

-- 定义一个存放快捷键的函数
local function keymap(maps)
    for _,map in pairs(maps) do
        vim.api.nvim_set_keymap(map[1], map[2], map[3], map[4])
    end

end

-- 自定义快捷键(按以下方式添加)
keymap({
    -- --------------------------------插入模式-------------------------------- --
    -- 设置退出insert模式为"jk"
    { 'i', 'jk',            '<ESC>',                                        {} },

    -- --------------------------------视觉模式-------------------------------- --
    -- 单行或者多行移动
    { 'v', 'J',             ":m '<-2<CR>gv=gv",                             {} },
    { 'v', 'K',             ":m '>+1<CR>gv=gv",                             {} },

    -- --------------------------------普通模式-------------------------------- --
    -- 取消高亮搜索
    { "n", '<leader>nh',    ':nohl<CR>',                                    {} },
})
